# GetTextureSize

## Description
Returns the texture size in real-world inches.

```pascal
FUNCTION GetTextureSize(texture : HANDLE) : REAL;
```

```python

def vs.GetTextureSize(texture):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|texture|HANDLE||

## Version
Availability: from VectorWorks10.1
## Category
* Textures